{"Required Python packages":["frappe>=14.0.0","lxml==4.9.2","xmlsec==1.3.13","requests==2.31.0","cryptography==41.0.7","python-dotenv==1.0.0"],"Required Other language third-party packages":["No third-party dependencies required"],"Logic Analysis":[["efactura_settings.py","Implementează setările globale și configurația conexiunii ANAF. Conține clasa EFacturaSettings cu metode pentru stocarea securizată a certificatelor și configurarea parametrilor de mediu."],["anaf_client.py","Clasa ANAFClient pentru comunicarea cu API-ul ANAF. Depinde de EFacturaSettings pentru parametrii de conexiune. Implementează metodele send_xml() și check_status()."],["xml_generator.py","Generarea XML conform standardului UBL 2.1. Clasa XMLGenerator cu metode pentru validarea Schematron și transformarea datelor din SalesInvoice în structura XML necesară."],["efactura_transaction.py","Modelul principal pentru gestionarea tranzacțiilor. Clasa EFacturaTransaction conține logica de trimitere/retrimitere către ANAF și integrează componentele XMLGenerator, DigitalSigner și ANAFClient."],["integration_button.html","Adaugă butonul de integrare ANAF în interfața Sales Invoice. Se conectează la evenimentul de submit al facturii."],["hooks.py","Configură hook-uri Frappe pentru încărcarea automată a extensiei, adăugarea de custom fields la Sales Invoice și inițializarea setărilor."],["efactura.py","Punctul central de integrare care leagă toate componentele. Conține logica de business pentru fluxul de e-facturare."]],"Task list":["efactura_settings.py","anaf_client.py","xml_generator.py","efactura_transaction.py","integration_button.html","hooks.py","efactura.py","__init__.py"],"Full API spec":"","Shared Knowledge":"1. Câmpurile criptate din Frappe sunt folosite pentru stocarea certificatelor\n2. Schemele XML Schematron sunt stocate în directorul /apps/frappe_ro_efactura/schemas\n3. Logica de retry utilizează decoratorul @frappe.whitelist() pentru metodele apelate din frontend\n4. Autentificarea OAuth2 necesită un endpoint dedicat pentru callback-uri ANAF","Anything UNCLEAR":"1. Detalii implementare OAuth2: Cerem documentația oficială ANAF pentru fluxul de autorizare exact\n2. Validare semnătură test: Confirmarea formatului certificatului de test și a regulilor de validare specifice ANAF\n3. Compatibilitate xmlsec: Verificarea versiunii corecte pentru compatibilitate cu certificațiile eIDAS"}